{"status":"success","totalResults":21671,"results":[{"title":"General Hospital Vet Ingo Rademacher Hits ABC With “Religious Discrimination” Suit Over Covid Vaccine Mandate","link":"https://deadline.com/2021/12/ingo-rademacher-general-hospital-covid-lawsuit-abc-1234890438/","keywords":["Breaking News","L.A. Local","Legal","Safety","ABC","Covid","General Hospital","Ingo Rademacher","Joe Biden"],"creator":["Dominic Patten"],"video_url":null,"description":"A couple of weeks after Ingo Rademacher was pink slipped from General Hospital by ABC for not getting a Covid-19 vaccination, the actor has jabbed the Disney-owned network with a wide-ranging civil rights lawsuit on constitutional grounds. “ABC’s actions are blatantly unlawful,” proclaims a jury trial seeking complaint filed today in LA Superior Court by […]","content":null,"pubDate":"2021-12-13 23:08:22","full_description":"Mere weeks after Ingo Rademacher was pink slipped from General Hospital by ABC for not getting a Covid -19 vaccination, the actor has jabbed the Disney-owned network with a wide-ranging civil rights lawsuit on constitutional grounds. “ABC’s actions are blatantly unlawful,” proclaims a jury trial seeking complaint filed today in LA Superior Court by the law firm of JW Howard Attorneys, LTD. “ABC does not have the authority to force a medical treatment to its employees against their will,” the filing goes on to say ( read it here ). “These actions constitute religious discrimination and violate Mr. Rademacher’s rights under state and federal law.” Long story short, if you’re not the biggest fan of the goings on of Port Charles, New York, the House of Mouse has one of the strictest vaccine mandates of any Hollywood studio and most major corporations. Now facing political challenges, to put it politely in Florida, Disney made having vaccination mandatory in late July for salaried and non-union hourly U.S. employees who worked at it is studios, networks, theme parks, and more. Related Story Broadway Extends Covid Vaccine Requirement To Children Ages 5-11 A GH regular since Bill Clinton was POTUS, Rademacher sought a religious exemption from the vaccine. After sitting down with the actor who played Jasper Jacks for decades, ABC decided on November 5 to deny Rademacher his desired exception and less than month later , the actor and his character were gone from the small screen. Rademacher had already been in the dog house with some of his cast mates for remarks he made on social media earlier this year about on transgender people – comments he later edited and apologized for. If you aren’t getting where this is all coming from, Joe Biden and Kamala Harris’ names are bandied about the suit and terms like “bodily integrity” and the right to “informational privacy” are in there too. Rademacher wants “ABC’s Covid-19 mandate declared unconstitutional” and he’s seeking compensatory damages for all the wages he’s lost out on for being shown the GH door. Though they will likely react in the LASC docket soon enough, ABC parent company Disney did not respond today to request for comment from Deadline on the Rademacher suit. TMZ first reported the filing. Also worth noting that while President Biden’s vaccine edict is being bogged down in the courts across the land, the New York Supreme Court turned down emergency requests by Empire State healthcare workers for a religious exemption from state requirements to vaccinate against Covid-19. A federal appeals court in New York previously denied the workers’ requests. Greg Evans contributed to this report","image_url":"https://deadline.com/wp-content/uploads/2021/12/Ingo-Rademacher-ABC-logo.jpg","source_id":"deadline"},{"title":"Gooseneck barnacles are one of the most expensive seafoods. But getting your hands on them is difficult.","link":"https://www.businessinsider.com/why-gooseneck-barnacles-so-expensive-2021-12","keywords":null,"creator":null,"video_url":null,"description":"One pound can cost over $100 in Spain and Portugal. Harvesting gooseneck barnacles comes with serious risks and even the possibility of death.","content":null,"pubDate":"2021-12-13 23:07:43","full_description":null,"image_url":"https://i.insider.com/61afdd166531110019cf087e?format=jpeg","source_id":"businessinsider_us"},{"title":"Brentford vs Manchester United talkSPORT commentary and team news: COVID-19 outbreak at Carrington puts Premier League contest in doubt","link":"https://talksport.com/football/1001844/brentford-manchester-united-live-team-news-covid-19-premier-league/","keywords":["Football","Premier League"],"creator":["Phil Spencer"],"video_url":null,"description":"Manchester United’s clash with Brentford on Tuesday night is in jeopardy following a COVID-19 outbreak at Carrington. A decision is expected to be made regarding whether a first-team squad will make the trip to London or if the fixture will be postponed. Should the fixture go ahead, it’ll be a tricky test for Ralf Rangnick’s […]","content":"Manchester United’s clash with Brentford on Tuesday night is in jeopardy following a COVID-19 outbreak at Carrington. A decision is expected to be made regarding whether a first-team squad will make the trip to London or if the fixture will be postponed. Thomas Tuchel and Ralf Rangnick will be hoping to go head-to-head Should the fixture go ahead, it’ll be a tricky test for Ralf Rangnick’s side. The Red Devils have won three on the bounce in the Premier League including the 1-0 victory over Norwich City at the weekend which pushed them up to fifth in the table. For Brentford, this will no doubt be a game that they’ll relish. Thomas Frank’s side recorded a 2-1 win over Watford on Friday night to push them up to 10th position in the table and firmly on track for a decent season. Rangnick will be waiting anxiously to see if Man United will travel down to London to face the BeesAFP Brentford vs Manchester United: Date and time The Premier League clash is scheduled to take place on Tuesday, December 14 at Brentford Community Stadium. Kick-off is scheduled for 7.30pm UK time. Victory could see United move into the top four. Brentford vs Manchester United: talkSPORT commentary The contest is due to be broadcast exclusively live on talkSPORT. It will be part of Kick Off Live which gets underway from 7pm UK time. Presented by Hugh Woozencroft, commentary will come from Sam Matterface and former Republic of Ireland midfielder Andy Townsend. Brentford vs Manchester United: Team news Ivan Toney is fit to feature for the Bees against Man United following his self-isolation period due to COVID-19. Sergi Canos is also available following suspension, however, David Raya and Kristoffer Ajer are ruled out. For United Edinson Cavani and Raphael Varane are in line to return, while Nemanja Matic, Juan Mata, and Aaron Wan-Bissaka are all in contention. However, this availability is subject to the ongoing COVID-19 outbreak at Carrington. Ivan Toney will be keen to hit the goal trail as he returns from COVID-19GETTY Brentford vs Manchester United: Match facts This is the first league meeting between Brentford and Manchester United since April 1947, a goalless draw at Griffin Park in the top-flight.Manchester United won the last time they faced Brentford in any competition, winning a League Cup tie 2-1 at Old Trafford in September 1975 thanks to goals from Lou Macari and Sammy McIlroy.Only Liverpool (57) have won a Premier League game in more different stadia than Manchester United (54), with Brentford Community Stadium the 60th different ground at which the Red Devils will have played in the competition.Brentford are unbeaten in their last 11 league games played on Tuesdays (W5 D6) since a 2-1 loss at Luton in February 2020.Manchester United are unbeaten in their last 12 Premier League away games against London sides since a 2-0 loss at Arsenal in January 2020. It’s their longest league run without defeat in the capital since a streak of 13 between December 2011 and December 2013Manchester United have won 34 of their 56 Premier League games played on Tuesdays, both the most wins and highest win rate (61%) of any side on this day of the week in the competition.Two of Brentford’s five Premier League victories this season have been courtesy of 90th minute winners, including their win against Watford last time out. The only side to have had more wins thanks to 90th minute goals in their maiden campaign in the competition were Wigan Athletic (3 in 2005-06).Manchester United have won both of their two league games so far under Ralf Rangnick 1-0. No manager in the club’s history has kept a clean sheet in each of their first three league games in charge of the Red Devils.All 10 of Brentford’s Premier League home goals have been scored by different players – they’re the first side in the history of the competition to see have their first 10 home goals be scored by 10 different players (excludes own goals).Manchester United’s Cristiano Ronaldo has scored seven Premier League goals this season – it’s the most by a player aged 36 and above in a single Premier League campaign since Graham Alexander in 2009-10 (7), while the last such player to net more was Gary Speed in 2006-07 (8). BETTING OFFER OF THE DAY Get 20/1 with WILLIAM HILL for Liverpool to have 1+ shot on target v Newcastle on Thursday – CLAIM HERE 18+. Play Safe. New customers using EPL20. Mobile only. Applies to bets placed from 09:00 14 December 2021 until 20:00 16 December 2021. Max £1 bet at 20/1. Returns paid as 2 x £10 free bets (30 day expiry). Player & currency restrictions & terms apply. begambleaware.org","pubDate":"2021-12-13 23:07:35","full_description":"Manchester United’s clash with Brentford on Tuesday night is in jeopardy following a COVID-19 outbreak at Carrington. A decision is expected to be made regarding whether a first-team squad will make the trip to London or if the fixture will be postponed. Should the fixture go ahead, it’ll be a tricky test for Ralf Rangnick’s side. The Red Devils have won three on the bounce in the Premier League including the 1-0 victory over Norwich City at the weekend which pushed them up to fifth in the table. For Brentford, this will no doubt be a game that they’ll relish. Thomas Frank’s side recorded a 2-1 win over Watford on Friday night to push them up to 10th position in the table and firmly on track for a decent season. The Premier League clash is scheduled to take place on Tuesday, December 14 at Brentford Community Stadium. Kick-off is scheduled for 7.30pm UK time. Victory could see United move into the top four. The contest is due to be broadcast exclusively live on talkSPORT. It will be part of Kick Off Live which gets underway from 7pm UK time. Presented by Hugh Woozencroft, commentary will come from Sam Matterface and former Republic of Ireland midfielder Andy Townsend. Ivan Toney is fit to feature for the Bees against Man United following his self-isolation period due to COVID-19. Sergi Canos is also available following suspension, however, David Raya and Kristoffer Ajer are ruled out. For United Edinson Cavani and Raphael Varane are in line to return, while Nemanja Matic, Juan Mata, and Aaron Wan-Bissaka are all in contention. However, this availability is subject to the ongoing COVID-19 outbreak at Carrington. Get 20/1 with WILLIAM HILL for Liverpool to have 1+ shot on target v Newcastle on Thursday – CLAIM HERE 18+. Play Safe. New customers using EPL20. Mobile only. Applies to bets placed from 09:00 14 December 2021 until 20:00 16 December 2021. Max £1 bet at 20/1. Returns paid as 2 x £10 free bets (30 day expiry). Player & currency restrictions & terms apply. begambleaware.org","image_url":null,"source_id":"talksport"},{"title":"Air Force discharges 27 for refusing COVID-19 vaccine","link":"https://www.wfaa.com/article/news/nation-world/air-force-discharges-27-refused-covid-vaccine/507-ab157150-7ff4-44fb-9194-5011a77c7b27","keywords":["nation-world","news","cct-tracking"],"creator":null,"video_url":null,"description":"Air Force spokeswoman Ann Stefanek said Monday that these are the first to be administratively discharged for reasons involving the vaccine.","content":null,"pubDate":"2021-12-13 23:06:55","full_description":null,"image_url":"https://media.tegna-media.com/assets/CCT/images/fc604c04-4c4d-4c63-b04d-a92f25fd5838/fc604c04-4c4d-4c63-b04d-a92f25fd5838_750x422.jpg","source_id":"wfaa"},{"title":"COVID-19 outbreaks declared over at St. Ignatius, St. Ann schools","link":"https://www.tbnewswatch.com/local-news/covid-19-outbreaks-declared-over-at-st-ignatius-st-ann-schools-4860697","keywords":null,"creator":["TBNewsWatch.com Staff"],"video_url":null,"description":"Thunder Bay District Health Unit declares outbreaks over at two local Catholic schools.","content":null,"pubDate":"2021-12-13 23:05:21","full_description":"THUNDER BAY – Health authorities have declared COVID-19 outbreaks resolved at two local Catholic schools, St. Ann School and St. Ignatius High School. The Thunder Bay District Health Unit announced the news Monday evening, saying it had found no evidence of additional spread of the virus at either school. Anyone identified as a positive case or close contact is still required to stay home and not return to the school until cleared by public health, the agency said. The health unit declared the outbreak at St. Ann on Nov. 26, three days after a case was first reported at the Westfort elementary school. There were a total of 18 cases confirmed in the outbreak, with the most recent reported on Dec. 3. The outbreak at St. Ignatius, declared on Nov. 27, involved just three cases. The most recent was reported at the Current River high school on Dec. 3.","image_url":"https://www.vmcdn.ca/f/files/tbnewswatch/images/local-news/2017/february/st-ignatius/img_7431.JPG;w=960","source_id":"tbnewswatch"},{"title":"Report: Lakers Among Teams Pursuing Pistons Forward Jerami Grant","link":"https://www.si.com/nba/2021/12/13/lakers-interested-jerami-grant-pistons-nba-trade-rumors","keywords":["detroit pistons","los angeles lakers","jerami grant","Wire","NBA"],"creator":["Michael Shapiro"],"video_url":null,"description":"Grant is averaging 20.1 points per game this season.","content":"Grant is averaging 20.1 points per game this season.View the original article to see embedded media.The Pistons reportedly have a number of suitors for forward Jerami Grant, and one championship contender appears eager to acquire the eighth-year forward.The Lakers are \"among the teams pursuing\" Grant, per The Athletic's Shams Charania. The Blazers are also among the teams reportedly interested in Grant. Detroit's forward is expected to be out for significant time due to a thumb injury, but Grant is an impact piece when he is on the floor. Grant is averaging 20.1 points per game in 2021-22, and he posted a career-best 22.3 points per game mark last season on 35% from three.Grant is eligible for a four-year extension this offseason worth up to $112 million. The Lakers enter Monday night sitting No. 6 in the Western Conference at 15–13. They will next take the floor on Sunday in a road matchup against the Mavericks.More NBA Coverage:• NBA Mailbag: Damian Lillard's Future With the Blazers• NBA Power Rankings: How High Can Kevin Durant Carry Nets?• NBA Trade Ideas: Can the Warriors Land Sabonis?","pubDate":"2021-12-13 23:05:03","full_description":"The Pistons reportedly have a number of suitors for forward Jerami Grant, and one championship contender appears eager to acquire the eighth-year forward. The Lakers are \"among the teams pursuing\" Grant, per The Athletic's Shams Charania . The Blazers are also among the teams reportedly interested in Grant. Detroit's forward is expected to be out for significant time due to a thumb injury, but Grant is an impact piece when he is on the floor. Grant is averaging 20.1 points per game in 2021-22, and he posted a career-best 22.3 points per game mark last season on 35% from three. Grant is eligible for a four-year extension this offseason worth up to $112 million. The Lakers enter Monday night sitting No. 6 in the Western Conference at 15–13. They will next take the floor on Sunday in a road matchup against the Mavericks. More NBA Coverage: • NBA Mailbag: Damian Lillard's Future With the Blazers • NBA Power Rankings: How High Can Kevin Durant Carry Nets? • NBA Trade Ideas: Can the Warriors Land Sabonis?","image_url":"http://www.si.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Ch_1200%2Cq_auto:good%2Cw_1200/MTg1OTU4NDI0NTc4NzYxODU3/jerami-grant-pistons.jpg","source_id":"si"},{"title":"WWE Raw Match Canceled Due to Injuries","link":"https://comicbook.com/wwe/news/wwe-raw-match-canceled-injuries-street-profits-rey-mysterio/","keywords":["WWE Monday Night RAW","Rey Mysterio (WWE)","Street Profits (NXT)"],"creator":["Connor Casey"],"video_url":null,"description":"This week's Monday Night Raw was supposed to crown new No. 1 contenders for RK-Bro's Raw Tag Team Championships. But in a video from WWE's digital team released hours before the show, it was confirmed that the match had been pushed to the Dec. 27 episode of Raw due to undisclosed injuries among both The ...","content":"✖This week's Monday Night Raw was supposed to crown new No. 1 contenders for RK-Bro's Raw Tag Team Championships. But in a video from WWE's digital team released hours before the show, it was confirmed that the match had been pushed to the Dec. 27 episode of Raw due to undisclosed injuries among both The Street Profits and Rey & Dominik Mysterio. Neither of the Mysterios nor Montez Ford wrestled at any live events over the past week, but Angelo Dawkins did compete in a pair of singles match over the weekend with AJ Styles. No matches have yet to be confirmed for tonight, though Bobby Lashley is expected to address attacking Big E, Kevin Owens and Seth Rollins on last week's episode. The show will undoubtedly continue the build to the New Year's Day Day 1 pay-per-view, which only has four matches booked as of now: {replyCount}comments BREAKING: Due to injuries suffered by both The #StreetProfits and The Mysterios, @sarahschreib reveals that the RK-Bro-nament Finals have been pushed back. #WWERaw pic.twitter.com/TrLykayxug-- WWE (@WWE) December 13, 2021 WWE Universal Championship: Roman Reigns vs. Brock Lesnar WWE Championship: Big E vs. Seth Rollins vs. Kevin Owens SmackDown Tag Team Championships: The Usos vs. The New Day Edge vs. The Miz This story is developing...","pubDate":"2021-12-13 23:05:00","full_description":"✖ This week's Monday Night Raw was supposed to crown new No. 1 contenders for RK-Bro's Raw Tag Team Championships. But in a video from WWE's digital team released hours before the show, it was confirmed that the match had been pushed to the Dec. 27 episode of Raw due to undisclosed injuries among both The Street Profits and Rey & Dominik Mysterio. Neither of the Mysterios nor Montez Ford wrestled at any live events over the past week, but Angelo Dawkins did compete in a pair of singles match over the weekend with AJ Styles. No matches have yet to be confirmed for tonight, though Bobby Lashley is expected to address attacking Big E, Kevin Owens and Seth Rollins on last week's episode. The show will undoubtedly continue the build to the New Year's Day Day 1 pay-per-view, which only has four matches booked as of now: 0 comments BREAKING: Due to injuries suffered by both The #StreetProfits and The Mysterios, @sarahschreib reveals that the RK-Bro-nament Finals have been pushed back. #WWERaw pic.twitter.com/TrLykayxug — WWE (@WWE) December 13, 2021 WWE Universal Championship: Roman Reigns vs. Brock Lesnar WWE Championship: Big E vs. Seth Rollins vs. Kevin Owens SmackDown Tag Team Championships: The Usos vs. The New Day Edge vs. The Miz This story is developing...","image_url":"https://sportshub.cbsistatic.com/i/2021/03/18/b41c17fc-7ef1-42b7-b6bc-7e1fa23b734e/wwe-raw-logo-2020-1241247.jpg","source_id":"comicbook"},{"title":"Salt Lake City ready to host another Olympics, U.S. official says, but when?","link":"https://www.deseret.com/utah/2021/12/13/22832653/salt-lake-city-ready-host-olympics-us-official-says-2030-2034-winter-games-beijing-china-boycott","keywords":null,"creator":["Lisa Riley Roche"],"video_url":null,"description":null,"content":"Competitors take part in World Cup Short Track speedskating at the Kearns Olympic Oval on Nov. 13, 2016. It looks like it’s going to be a while longer before backers of bringing another Olympics to Utah know whether they’re bidding for the 2030 or 2034 Winter Games. | Scott G Winterton, Deseret News Decision between 2030 and 2034 Winter Games bid now coming mid 2022 It looks like it’s going to be a while longer before backers of bringing another Olympics to Utah know whether they’re bidding for the 2030 or 2034 Winter Games. The hope had been that the U.S. Olympic and Paralympic Committee, which chose Salt Lake City over Denver three years ago to bid on behalf of the country for an unspecified future Winter Games, would make a decision by the end of the year. But now that’s not likely to happen until well after the 2022 Winter Games that begin in Beijing next February, said Fraser Bullock, who served as chief operating officer of the 2002 Winter Games in Salt Lake City and is now president and CEO of the bid effort. “We’re making progress. I believe that issue will be resolved post-Beijing, maybe in the first half of next year. That will be our target,” Bullock told reporters after Monday’s private meeting of the Salt Lake City-Utah Committee for the Games’ governing board. During the larger bid committee’s meeting at the University of Utah’s Rice-Eccles Stadium, the CEO of the USOPC, Sarah Hirshland, said it’s still not clear the United States can hold financially successful back-to-back Olympics. “The good news is, Salt Lake is ready. We don’t have to build anything. We don’t need to garner public support. We don’t have a lot of barriers,” Hirshland said, other than a big one — Los Angeles hosting the 2028 Summer Games. “The barrier for Salt Lake and a Winter Games right now is just the evaluation of 18 months after a Summer Games in this country,” she told the business and community officials and athletes who serve on the bid committee. It comes down to money, Hirshland said. There has long been concern that a 2030 Winter Games in Salt Lake City would not only have trouble raising domestic sponsorship dollars but also hurt Los Angeles’ ability to secure enough revenue for what is a much larger and much more expensive event to host. For the United States to carry off two Olympics in a row without spending local or state tax dollars, Hirshland said “inevitably” both would have to team up to raise revenues from the private sector. “You have to think about revenue generation in a collaborative way,” she said. “That’s not a bad thing. It just is more complicated.” Salt Lake City faces competition for 2030 and beyond under the International Olympic Committee’s new, less formal process for choosing a Games host, from Vancouver, Canada; Sapporo, Japan; Barcelona and the Pyrenees mountain region; and Ukraine. Both Hirshland and Bullock said the IOC knows there’s interest in 2030. There is no timeline for the IOC to pick a site for 2030 and it’s possible multiple Winter Games could be awarded at the same time, as was done for the 2024 and 2028 Summer Games. Utah bidders want 2030 and Bullock said while there would be challenges, “our country could be energized” by hosting another Olympics right away. The bid committee is readying budgets and contracts with venues and hotels for both 2030 and 2034. Hirshland, who said she is now more confident about pulling off both a Summer and a Winter Games in less than two years, suggested the IOC — which, of course, shares the revenues generated by an Olympics — still might need convincing. “if we can — which I believe we will here in short order — get the IOC really comfortable that, No. 1, the LA ‘28 Games are going to be wildly successful. That has got to be their No. 1 priority, and ours,” she said. And if that can be combined with the promise of a similarly successful Winter Games in Salt Lake City, Hirshland said, “we’re going to be really well positioned for the IOC and us to say, ‘Let’s do this.”’ But if that time crunch would have too much of an impact on the bottom line, she said, “you could see the IOC and us saying, ‘We’re better served in ‘34 for these reasons.’ I will say, I was more skeptical 12 months ago than I was today about our ability to make ‘30 work.” Bullock told reporters the newly announced budget for a 2030 Winter Games — $2.2 billion in 2030 dollars — includes a $200 million contingency fund that could be tapped if domestic sponsorships don’t come in as anticipated. That’s in addition to $250 million set aside for a legacy fund to maintain the Olympic venues first built for 2002 as well as help the Utah Sports Commission make the state an international winter sports capital. The price tag for hosting in 2030 is about $200 million less than what it cost for the 2002 Winter Games after inflation, Bullock said. The bid budget is $2.8 million, plus an additional $1 million contingency fund, although only about $300,000 has been used so far. Monday’s meetings follow a pair of virtual sessions with the IOC, in November and earlier this month. None of the cities bidding have advanced to the next level of the new bid process that comes after the IOC had identified preferred hosts for a specific Games. Little was said about the diplomatic boycott of the Beijing Olympics announced by President Joe Biden to protest China’s human rights record and supported by other nations including the United Kingdom. Bullock, along with the bid committee’s chair Catherine Raney Norman, and a consultant, are headed to Beijing despite the boycott as future host city observers at the invitation of the IOC, something other Winter Games bidders are also expected to do. “Our focus is on our Games,” Bullock said. “We have our head down. We’re working on that. We know there are political issues that are out there but that’s not our area. We’re just focused on preparing for a future Games.”","pubDate":"2021-12-13 23:05:00","full_description":"It looks like it’s going to be a while longer before backers of bringing another Olympics to Utah know whether they’re bidding for the 2030 or 2034 Winter Games. The hope had been that the U.S. Olympic and Paralympic Committee, which chose Salt Lake City over Denver three years ago to bid on behalf of the country for an unspecified future Winter Games, would make a decision by the end of the year. But now that’s not likely to happen until well after the 2022 Winter Games that begin in Beijing next February, said Fraser Bullock, who served as chief operating officer of the 2002 Winter Games in Salt Lake City and is now president and CEO of the bid effort. “We’re making progress. I believe that issue will be resolved post-Beijing, maybe in the first half of next year. That will be our target,” Bullock told reporters after Monday’s private meeting of the Salt Lake City-Utah Committee for the Games ’ governing board. Related What the IOC president had to say about Utah’s Olympic bid During the larger bid committee’s meeting at the University of Utah’s Rice-Eccles Stadium, the CEO of the USOPC, Sarah Hirshland, said it’s still not clear the United States can hold financially successful back-to-back Olympics. “The good news is, Salt Lake is ready. We don’t have to build anything. We don’t need to garner public support. We don’t have a lot of barriers,” Hirshland said, other than a big one — Los Angeles hosting the 2028 Summer Games. “The barrier for Salt Lake and a Winter Games right now is just the evaluation of 18 months after a Summer Games in this country,” she told the business and community officials and athletes who serve on the bid committee. It comes down to money, Hirshland said. There has long been concern that a 2030 Winter Games in Salt Lake City would not only have trouble raising domestic sponsorship dollars but also hurt Los Angeles’ ability to secure enough revenue for what is a much larger and much more expensive event to host. For the United States to carry off two Olympics in a row without spending local or state tax dollars, Hirshland said “inevitably” both would have to team up to raise revenues from the private sector. “You have to think about revenue generation in a collaborative way,” she said. “That’s not a bad thing. It just is more complicated.” Salt Lake City faces competition for 2030 and beyond under the International Olympic Committee’s new, less formal process for choosing a Games host, from Vancouver, Canada; Sapporo, Japan; Barcelona and the Pyrenees mountain region; and Ukraine. Both Hirshland and Bullock said the IOC knows there’s interest in 2030. There is no timeline for the IOC to pick a site for 2030 and it’s possible multiple Winter Games could be awarded at the same time, as was done for the 2024 and 2028 Summer Games. Utah bidders want 2030 and Bullock said while there would be challenges, “our country could be energized” by hosting another Olympics right away. The bid committee is readying budgets and contracts with venues and hotels for both 2030 and 2034. Related Does another Winter Olympics make sense for Utah? Hirshland, who said she is now more confident about pulling off both a Summer and a Winter Games in less than two years, suggested the IOC — which, of course, shares the revenues generated by an Olympics — still might need convincing. “If we can — which I believe we will here in short order — get the IOC really comfortable that, No. 1, the LA ’28 Games are going to be wildly successful. That has got to be their No. 1 priority, and ours,” she said. And if that can be combined with the promise of a similarly successful Winter Games in Salt Lake City, Hirshland said, “we’re going to be really well positioned for the IOC and us to say, ‘Let’s do this.”’ But if that time crunch would have too much of an impact on the bottom line, she said, “you could see the IOC and us saying, ‘We’re better served in ’34 for these reasons.’ I will say, I was more skeptical 12 months ago than I was today about our ability to make ’30 work.” Bullock told reporters the newly announced budget for a 2030 Winter Games — $2.2 billion in 2030 dollars — includes a $200 million contingency fund that could be tapped if domestic sponsorships don’t come in as anticipated. That’s in addition to $250 million set aside for a legacy fund to maintain the Olympic venues first built for 2002 as well as help the Utah Sports Commission make the state an international winter sports capital. The price tag for hosting in 2030 is about $200 million less than what it cost for the 2002 Winter Games after inflation, Bullock said. The bid budget is $2.8 million, plus an additional $1 million contingency fund, although only about $300,000 has been used so far. Monday’s meetings follow a pair of virtual sessions with the IOC, in November and earlier this month. None of the cities bidding have advanced to the next level of the new bid process that comes after the IOC had identified preferred hosts for a specific Games. Little was said about the diplomatic boycott of the Beijing Olympics announced by President Joe Biden to protest China’s human rights record and supported by other nations, including the United Kingdom. Bullock, along with bid committee chairwoman Catherine Raney Norman and a consultant, are headed to Beijing despite the boycott as future host city observers at the invitation of the IOC, something other Winter Games bidders are also expected to do. “Our focus is on our Games,” Bullock said. “We have our head down. We’re working on that. We know there are political issues that are out there but that’s not our area. We’re just focused on preparing for a future Games.”","image_url":null,"source_id":"deseret"},{"title":"Snapdragon 888 Plus Chip Beefs Up Motorola Edge S30 5G","link":"https://www.channelnews.com.au/snapdragon-888-plus-chip-beefs-up-motorola-edge-s30-5g/","keywords":["Latest News","Android 11","Bluetooth sharing tech","dolby atmos","Edge S 5G","LCD screen","motorola","qualcomm","Snapdragon 888 Plus"],"creator":["Luke Anisimoff"],"video_url":null,"description":"After the launch of the Motorola Edge S 5G earlier this year, the new S30 5G has come along packing a Qualcomm Snapdragon 888 Plus chipset, as well as refined design and specs. There’s a 6.8″ straight-edge LCD screen that has FHD+ resolution at 2460 x 1080 pixels. Plus, it supports HDR and a 144Hz... Read More","content":"After the launch of the Motorola Edge S 5G earlier this year, the new S30 5G has come along packing a Qualcomm Snapdragon 888 Plus chipset, as well as refined design and specs. There’s a 6.8″ straight-edge LCD screen that has FHD+ resolution at 2460 x 1080 pixels. Plus, it supports HDR and a 144Hz refresh rate, and touch sampling rate up to 576Hz. The display is also certified by SGS so it’s going to be good mates with your eyes. But the star her eis the hardware, with the Snapdragon 888 Plus chipset built on Samsung’s 5nm process. While it still uses three-cluster architecture, of a 3.0GHz Cortex super core, a 2.4Ghz Cortex A78 large core and a 1.8GHz Cortex A55 energy efficiency core, the main frequency has been boosted from the Snapdragon 888’s 2.84GHz to the Plus’s 3.0Ghz, though the GPU remains the Adreno 660. On top of all that, AI performance has seen a leap, with computing power up 20 per cent to 32TOPS. It also comes in three memory versions – 6GB, 8GB and 12GB. In terms of cameras, it has a triple set-up on the back left-hand side – a 100MP main lens backed up by a 13MP ultra-wide angle and a 2MP depth sensor. For sound, it supports Dolby Atmos, adding Qualcomm’s latest Bluetooth sharing tech (QSS). So how does this all run? With a 5000mAh battery, which supports fast charging. Oh, and it’s all on Android 11.","pubDate":"2021-12-13 23:04:43","full_description":null,"image_url":null,"source_id":"channelnews"},{"title":"Vince & Stephanie McMahon, Nick Khan Named Among Sports Business’ Most Influential People","link":"https://411mania.com/wrestling/vince-stephanie-mcmahon-nick-khan-named-among-sports-business-most-influential-people/","keywords":["Nick Khan","Stephanie McMahon","Vince McMahon","WWE"],"creator":["Jeremy Thomas"],"video_url":null,"description":"WWE executives Vince McMahon, Stephanie McMahon, Nick Khan have been named among the most influential people in sports business. The post Vince & Stephanie McMahon, Nick Khan Named Among Sports Business’ Most Influential People appeared first on 411MANIA.","content":null,"pubDate":"2021-12-13 23:03:20","full_description":null,"image_url":null,"source_id":"411mania"}],"nextPage":1}
